tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1503_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1503_H_
#define _PIC16LF1503_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTC                         42
#define RC0                           43
#define RC1                           44
#define RC2                           45
#define RC3                           46
#define RC4                           47
#define RC5                           48
#define PIR1                          49
#define TMR1IF                        50
#define TMR2IF                        51
#define SSP1IF                        52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define NCO1IF                        56
#define BCL1IF                        57
#define C1IF                          58
#define C2IF                          59
#define PIR3                          60
#define CLC1IF                        61
#define CLC2IF                        62
#define TMR0                          63
#define TMR1L                         64
#define TMR1H                         65
#define T1CON                         66
#define TMR1ON                        67
#define nT1SYNC                       68
#define T1OSCEN                       69
#define T1CKPS0                       70
#define T1CKPS                        71
#define T1CKPS1                       72
#define TMR1CS0                       73
#define TMR1CS                        74
#define TMR1CS1                       75
#define T1GCON                        76
#define T1GSS0                        77
#define T1GSS                         78
#define T1GSS1                        79
#define T1GVAL                        80
#define T1GGO_nDONE                   81
#define T1GSPM                        82
#define T1GTM                         83
#define T1GPOL                        84
#define TMR1GE                        85
#define TMR2                          86
#define PR2                           87
#define T2CON                         88
#define T2CKPS0                       89
#define T2CKPS                        90
#define T2CKPS1                       91
#define TMR2ON                        92
#define T2OUTPS0                      93
#define T2OUTPS                       94
#define T2OUTPS1                      95
#define T2OUTPS2                      96
#define T2OUTPS3                      97
#define TRISA                         98
#define TRISA0                        99
#define TRISA1                        100
#define TRISA2                        101
#define TRISA3                        102
#define TRISA4                        103
#define TRISA5                        104
#define TRISC                         105
#define TRISC0                        106
#define TRISC1                        107
#define TRISC2                        108
#define TRISC3                        109
#define TRISC4                        110
#define TRISC5                        111
#define PIE1                          112
#define TMR1IE                        113
#define TMR2IE                        114
#define SSP1IE                        115
#define ADIE                          116
#define TMR1GIE                       117
#define PIE2                          118
#define NCO1IE                        119
#define BCL1IE                        120
#define C1IE                          121
#define C2IE                          122
#define PIE3                          123
#define CLC1IE                        124
#define CLC2IE                        125
#define OPTION_REG                    126
#define PS                            127
#define PS0                           128
#define PS1                           129
#define PS2                           130
#define PSA                           131
#define T0SE                          132
#define TMR0SE                        133
#define T0CS                          134
#define TMR0CS                        135
#define INTEDG                        136
#define nWPUEN                        137
#define PCON                          138
#define nBOR                          139
#define nPOR                          140
#define nRI                           141
#define nRMCLR                        142
#define nRWDT                         143
#define STKUNF                        144
#define STKOVF                        145
#define WDTCON                        146
#define SWDTEN                        147
#define WDTPS                         148
#define WDTPS0                        149
#define WDTPS1                        150
#define WDTPS2                        151
#define WDTPS3                        152
#define WDTPS4                        153
#define OSCCON                        154
#define SCS0                          155
#define SCS                           156
#define SCS1                          157
#define IRCF                          158
#define IRCF0                         159
#define IRCF1                         160
#define IRCF2                         161
#define IRCF3                         162
#define OSCSTAT                       163
#define HFIOFS                        164
#define LFIOFR                        165
#define HFIOFR                        166
#define ADRESL                        167
#define ADRESH                        168
#define ADCON0                        169
#define ADON                          170
#define GO_nDONE                      171
#define GO                            172
#define ADGO                          173
#define CHS0                          174
#define CHS                           175
#define CHS1                          176
#define CHS2                          177
#define CHS3                          178
#define CHS4                          179
#define ADCON1                        180
#define ADPREF                        181
#define ADPREF0                       182
#define ADPREF1                       183
#define ADCS                          184
#define ADFM                          185
#define ADCON2                        186
#define TRIGSEL                       187
#define TRIGSEL0                      188
#define TRIGSEL1                      189
#define TRIGSEL2                      190
#define TRIGSEL3                      191
#define LATA                          192
#define LATA0                         193
#define LATA1                         194
#define LATA2                         195
#define LATA4                         196
#define LATA5                         197
#define LATC                          198
#define LATC0                         199
#define LATC1                         200
#define LATC2                         201
#define LATC3                         202
#define LATC4                         203
#define LATC5                         204
#define CM1CON0                       205
#define C1SYNC                        206
#define C1HYS                         207
#define C1SP                          208
#define C1POL                         209
#define C1OE                          210
#define C1OUT                         211
#define C1ON                          212
#define CM1CON1                       213
#define C1NCH0                        214
#define C1NCH                         215
#define C1NCH1                        216
#define C1NCH2                        217
#define C1PCH                         218
#define C1PCH0                        219
#define C1PCH1                        220
#define C1INTN                        221
#define C1INTP                        222
#define CM2CON0                       223
#define C2SYNC                        224
#define C2HYS                         225
#define C2SP                          226
#define C2POL                         227
#define C2OE                          228
#define C2OUT                         229
#define C2ON                          230
#define CM2CON1                       231
#define C2NCH0                        232
#define C2NCH                         233
#define C2NCH1                        234
#define C2NCH2                        235
#define C2PCH                         236
#define C2PCH0                        237
#define C2PCH1                        238
#define C2INTN                        239
#define C2INTP                        240
#define CMOUT                         241
#define MC1OUT                        242
#define MC2OUT                        243
#define BORCON                        244
#define BORRDY                        245
#define BORFS                         246
#define SBOREN                        247
#define FVRCON                        248
#define ADFVR0                        249
#define ADFVR                         250
#define ADFVR1                        251
#define CDAFVR                        252
#define CDAFVR0                       253
#define CDAFVR1                       254
#define TSRNG                         255
#define TSEN                          256
#define FVRRDY                        257
#define FVREN                         258
#define DACCON0                       259
#define DACPSS                        260
#define DACOE2                        261
#define DACOE1                        262
#define DACEN                         263
#define DACCON1                       264
#define DACR0                         265
#define DACR                          266
#define DACR1                         267
#define DACR2                         268
#define DACR3                         269
#define DACR4                         270
#define APFCON                        271
#define NCO1SEL                       272
#define CLC1SEL                       273
#define T1GSEL                        274
#define SSSEL                         275
#define SDOSEL                        276
#define ANSA0                         277
#define ANSELA                        278
#define ANSA1                         279
#define ANSA2                         280
#define ANSA4                         281
#define ANSC0                         282
#define ANSELC                        283
#define ANSC1                         284
#define ANSC2                         285
#define ANSC3                         286
#define PMADRL                        287
#define PMADRH                        288
#define PMDATL                        289
#define PMDATH                        290
#define PMCON1                        291
#define RD                            292
#define WR                            293
#define WREN                          294
#define WRERR                         295
#define FREE                          296
#define LWLO                          297
#define CFGS                          298
#define PMCON2                        299
#define WPUA0                         300
#define WPUA                          301
#define WPUA1                         302
#define WPUA2                         303
#define WPUA3                         304
#define WPUA4                         305
#define WPUA5                         306
#define SSP1BUF                       307
#define SSPBUF                        308
#define SSP1ADD                       309
#define ADD                           310
#define SSP1MSK                       311
#define MSK                           312
#define SSP1STAT                      313
#define BF                            314
#define UA                            315
#define R_nW                          316
#define S                             317
#define P                             318
#define D_nA                          319
#define CKE                           320
#define SMP                           321
#define SSP1CON1                      322
#define SSPM0                         323
#define SSPM                          324
#define SSPM1                         325
#define SSPM2                         326
#define SSPM3                         327
#define CKP                           328
#define SSPEN                         329
#define SSPOV                         330
#define WCOL                          331
#define SSP1CON2                      332
#define SEN                           333
#define RSEN                          334
#define PEN                           335
#define RCEN                          336
#define ACKEN                         337
#define ACKDT                         338
#define ACKSTAT                       339
#define GCEN                          340
#define SSP1CON3                      341
#define DHEN                          342
#define AHEN                          343
#define SBCDE                         344
#define SDAHT                         345
#define BOEN                          346
#define SCIE                          347
#define PCIE                          348
#define ACKTIM                        349
#define IOCAP                         350
#define IOCAP0                        351
#define IOCAP1                        352
#define IOCAP2                        353
#define IOCAP3                        354
#define IOCAP4                        355
#define IOCAP5                        356
#define IOCAN0                        357
#define IOCAN                         358
#define IOCAN1                        359
#define IOCAN2                        360
#define IOCAN3                        361
#define IOCAN4                        362
#define IOCAN5                        363
#define IOCAF0                        364
#define IOCAF                         365
#define IOCAF1                        366
#define IOCAF2                        367
#define IOCAF3                        368
#define IOCAF4                        369
#define IOCAF5                        370
#define NCO1ACCL                      371
#define NCO1ACC0                      372
#define NCO1ACC1                      373
#define NCO1ACC2                      374
#define NCO1ACC3                      375
#define NCO1ACC4                      376
#define NCO1ACC5                      377
#define NCO1ACC6                      378
#define NCO1ACC7                      379
#define NCO1ACCH                      380
#define NCO1ACC8                      381
#define NCO1ACC9                      382
#define NCO1ACC10                     383
#define NCO1ACC11                     384
#define NCO1ACC12                     385
#define NCO1ACC13                     386
#define NCO1ACC14                     387
#define NCO1ACC15                     388
#define NCO1ACCU                      389
#define NCO1ACC16                     390
#define NCO1ACC17                     391
#define NCO1ACC18                     392
#define NCO1ACC19                     393
#define NCO1INCL                      394
#define NCO1INC0                      395
#define NCO1INC1                      396
#define NCO1INC2                      397
#define NCO1INC3                      398
#define NCO1INC4                      399
#define NCO1INC5                      400
#define NCO1INC6                      401
#define NCO1INC7                      402
#define NCO1INCH                      403
#define NCO1INC8                      404
#define NCO1INC9                      405
#define NCO1INC10                     406
#define NCO1INC11                     407
#define NCO1INC12                     408
#define NCO1INC13                     409
#define NCO1INC14                     410
#define NCO1INC15                     411
#define NCO1CON                       412
#define N1PFM                         413
#define N1POL                         414
#define N1OUT                         415
#define N1OE                          416
#define N1EN                          417
#define NCO1CLK                       418
#define N1CKS                         419
#define N1CKS0                        420
#define N1CKS1                        421
#define N1PWS0                        422
#define N1PWS                         423
#define N1PWS1                        424
#define N1PWS2                        425
#define PWM1DCL                       426
#define PWM1DCL0                      427
#define PWM1DCL1                      428
#define PWM1DCH                       429
#define PWM1DCH0                      430
#define PWM1DCH1                      431
#define PWM1DCH2                      432
#define PWM1DCH3                      433
#define PWM1DCH4                      434
#define PWM1DCH5                      435
#define PWM1DCH6                      436
#define PWM1DCH7                      437
#define PWM1CON                       438
#define PWM1POL                       439
#define PWM1OUT                       440
#define PWM1OE                        441
#define PWM1EN                        442
#define PWM2DCL0                      443
#define PWM2DCL                       444
#define PWM2DCL1                      445
#define PWM2DCH0                      446
#define PWM2DCH                       447
#define PWM2DCH1                      448
#define PWM2DCH2                      449
#define PWM2DCH3                      450
#define PWM2DCH4                      451
#define PWM2DCH5                      452
#define PWM2DCH6                      453
#define PWM2DCH7                      454
#define PWM2CON                       455
#define PWM2POL                       456
#define PWM2OUT                       457
#define PWM2OE                        458
#define PWM2EN                        459
#define PWM3DCL0                      460
#define PWM3DCL                       461
#define PWM3DCL1                      462
#define PWM3DCH0                      463
#define PWM3DCH                       464
#define PWM3DCH1                      465
#define PWM3DCH2                      466
#define PWM3DCH3                      467
#define PWM3DCH4                      468
#define PWM3DCH5                      469
#define PWM3DCH6                      470
#define PWM3DCH7                      471
#define PWM3CON                       472
#define PWM3POL                       473
#define PWM3OUT                       474
#define PWM3OE                        475
#define PWM3EN                        476
#define PWM4DCL                       477
#define PWM4DCL0                      478
#define PWM4DCL1                      479
#define PWM4DCH0                      480
#define PWM4DCH                       481
#define PWM4DCH1                      482
#define PWM4DCH2                      483
#define PWM4DCH3                      484
#define PWM4DCH4                      485
#define PWM4DCH5                      486
#define PWM4DCH6                      487
#define PWM4DCH7                      488
#define PWM4CON                       489
#define PWM4POL                       490
#define PWM4OUT                       491
#define PWM4OE                        492
#define PWM4EN                        493
#define CWG1DBR0                      494
#define CWG1DBR                       495
#define CWG1DBR1                      496
#define CWG1DBR2                      497
#define CWG1DBR3                      498
#define CWG1DBR4                      499
#define CWG1DBR5                      500
#define CWG1DBF                       501
#define CWG1DBF0                      502
#define CWG1DBF1                      503
#define CWG1DBF2                      504
#define CWG1DBF3                      505
#define CWG1DBF4                      506
#define CWG1DBF5                      507
#define CWG1CON0                      508
#define G1CS0                         509
#define G1CS                          510
#define G1POLA                        511
#define G1POLB                        512
#define G1OEA                         513
#define G1OEB                         514
#define G1EN                          515
#define CWG1CON1                      516
#define G1IS0                         517
#define G1IS                          518
#define G1IS1                         519
#define G1IS2                         520
#define G1ASDLA                       521
