tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1503_tdd.h
#define G1ASDLA0                      522
#define G1ASDLA1                      523
#define G1ASDLB                       524
#define G1ASDLB0                      525
#define G1ASDLB1                      526
#define CWG1CON2                      527
#define G1ASDSCLC2                    528
#define G1ASDSFLT                     529
#define G1ASDSC1                      530
#define G1ASDSC2                      531
#define G1ARSEN                       532
#define G1ASE                         533
#define CLCDATA                       534
#define MCLC1OUT                      535
#define MCLC2OUT                      536
#define CLC1CON                       537
#define LC1MODE0                      538
#define LC1MODE                       539
#define CLC1CON_LCMODE0               540
#define LC1MODE1                      541
#define CLC1CON_LCMODE1               542
#define CLC1CON_LCMODE2               543
#define LC1MODE2                      544
#define LC1INTN                       545
#define CLC1CON_LCINTN                546
#define LC1INTP                       547
#define CLC1CON_LCINTP                548
#define CLC1CON_LCOUT                 549
#define LC1OUT                        550
#define LC1OE                         551
#define CLC1CON_LCOE                  552
#define LC1EN                         553
#define CLC1CON_LCEN                  554
#define CLC1POL                       555
#define LC1G1POL                      556
#define CLC1POL_G1POL                 557
#define CLC1POL_G2POL                 558
#define LC1G2POL                      559
#define LC1G3POL                      560
#define CLC1POL_G3POL                 561
#define LC1G4POL                      562
#define CLC1POL_G4POL                 563
#define CLC1POL_POL                   564
#define LC1POL                        565
#define CLC1SEL0                      566
#define LC1D1S                        567
#define CLC1SEL0_D1S0                 568
#define LC1D1S0                       569
#define CLC1SEL0_D1S1                 570
#define LC1D1S1                       571
#define CLC1SEL0_D1S2                 572
#define LC1D1S2                       573
#define LC1D2S                        574
#define LC1D2S0                       575
#define CLC1SEL0_D2S0                 576
#define LC1D2S1                       577
#define CLC1SEL0_D2S1                 578
#define LC1D2S2                       579
#define CLC1SEL0_D2S2                 580
#define CLC1SEL1                      581
#define LC1D3S0                       582
#define CLC1SEL1_D3S0                 583
#define LC1D3S                        584
#define LC1D3S1                       585
#define CLC1SEL1_D3S1                 586
#define LC1D3S2                       587
#define CLC1SEL1_D3S2                 588
#define LC1D4S                        589
#define LC1D4S0                       590
#define CLC1SEL1_D4S0                 591
#define LC1D4S1                       592
#define CLC1SEL1_D4S1                 593
#define LC1D4S2                       594
#define CLC1SEL1_D4S2                 595
#define CLC1GLS0                      596
#define CLC1GLS0_D1N                  597
#define LC1G1D1N                      598
#define CLC1GLS0_D1T                  599
#define LC1G1D1T                      600
#define LC1G1D2N                      601
#define CLC1GLS0_D2N                  602
#define LC1G1D2T                      603
#define CLC1GLS0_D2T                  604
#define CLC1GLS0_D3N                  605
#define LC1G1D3N                      606
#define CLC1GLS0_D3T                  607
#define LC1G1D3T                      608
#define CLC1GLS0_D4N                  609
#define LC1G1D4N                      610
#define CLC1GLS0_D4T                  611
#define LC1G1D4T                      612
#define CLC1GLS1                      613
#define CLC1GLS1_D1N                  614
#define LC1G2D1N                      615
#define LC1G2D1T                      616
#define CLC1GLS1_D1T                  617
#define CLC1GLS1_D2N                  618
#define LC1G2D2N                      619
#define LC1G2D2T                      620
#define CLC1GLS1_D2T                  621
#define CLC1GLS1_D3N                  622
#define LC1G2D3N                      623
#define LC1G2D3T                      624
#define CLC1GLS1_D3T                  625
#define CLC1GLS1_D4N                  626
#define LC1G2D4N                      627
#define LC1G2D4T                      628
#define CLC1GLS1_D4T                  629
#define CLC1GLS2                      630
#define CLC1GLS2_D1N                  631
#define LC1G3D1N                      632
#define LC1G3D1T                      633
#define CLC1GLS2_D1T                  634
#define LC1G3D2N                      635
#define CLC1GLS2_D2N                  636
#define LC1G3D2T                      637
#define CLC1GLS2_D2T                  638
#define CLC1GLS2_D3N                  639
#define LC1G3D3N                      640
#define LC1G3D3T                      641
#define CLC1GLS2_D3T                  642
#define LC1G3D4N                      643
#define CLC1GLS2_D4N                  644
#define LC1G3D4T                      645
#define CLC1GLS2_D4T                  646
#define CLC1GLS3                      647
#define LC1G4D1N                      648
#define CLC1GLS3_G4D1N                649
#define LC1G4D1T                      650
#define CLC1GLS3_G4D1T                651
#define CLC1GLS3_G4D2N                652
#define LC1G4D2N                      653
#define CLC1GLS3_G4D2T                654
#define LC1G4D2T                      655
#define LC1G4D3N                      656
#define CLC1GLS3_G4D3N                657
#define LC1G4D3T                      658
#define CLC1GLS3_G4D3T                659
#define CLC1GLS3_G4D4N                660
#define LC1G4D4N                      661
#define CLC1GLS3_G4D4T                662
#define LC1G4D4T                      663
#define CLC2CON                       664
#define LC2MODE0                      665
#define LC2MODE                       666
#define CLC2CON_LCMODE0               667
#define LC2MODE1                      668
#define CLC2CON_LCMODE1               669
#define LC2MODE2                      670
#define CLC2CON_LCMODE2               671
#define LC2INTN                       672
#define CLC2CON_LCINTN                673
#define LC2INTP                       674
#define CLC2CON_LCINTP                675
#define CLC2CON_LCOUT                 676
#define LC2OUT                        677
#define LC2OE                         678
#define CLC2CON_LCOE                  679
#define CLC2CON_LCEN                  680
#define LC2EN                         681
#define CLC2POL                       682
#define LC2G1POL                      683
#define CLC2POL_G1POL                 684
#define LC2G2POL                      685
#define CLC2POL_G2POL                 686
#define LC2G3POL                      687
#define CLC2POL_G3POL                 688
#define LC2G4POL                      689
#define CLC2POL_G4POL                 690
#define CLC2POL_POL                   691
#define LC2POL                        692
#define CLC2SEL0                      693
#define LC2D1S0                       694
#define CLC2SEL0_D1S0                 695
#define LC2D1S                        696
#define LC2D1S1                       697
#define CLC2SEL0_D1S1                 698
#define LC2D1S2                       699
#define CLC2SEL0_D1S2                 700
#define LC2D2S0                       701
#define LC2D2S                        702
#define CLC2SEL0_D2S0                 703
#define LC2D2S1                       704
#define CLC2SEL0_D2S1                 705
#define LC2D2S2                       706
#define CLC2SEL0_D2S2                 707
#define CLC2SEL1                      708
#define CLC2SEL1_D3S0                 709
#define LC2D3S0                       710
#define LC2D3S                        711
#define LC2D3S1                       712
#define CLC2SEL1_D3S1                 713
#define LC2D3S2                       714
#define CLC2SEL1_D3S2                 715
#define LC2D4S                        716
#define LC2D4S0                       717
#define CLC2SEL1_D4S0                 718
#define LC2D4S1                       719
#define CLC2SEL1_D4S1                 720
#define LC2D4S2                       721
#define CLC2SEL1_D4S2                 722
#define CLC2GLS0                      723
#define LC2G1D1N                      724
#define CLC2GLS0_D1N                  725
#define CLC2GLS0_D1T                  726
#define LC2G1D1T                      727
#define LC2G1D2N                      728
#define CLC2GLS0_D2N                  729
#define CLC2GLS0_D2T                  730
#define LC2G1D2T                      731
#define LC2G1D3N                      732
#define CLC2GLS0_D3N                  733
#define CLC2GLS0_D3T                  734
#define LC2G1D3T                      735
#define LC2G1D4N                      736
#define CLC2GLS0_D4N                  737
#define CLC2GLS0_D4T                  738
#define LC2G1D4T                      739
#define CLC2GLS1                      740
#define CLC2GLS1_D1N                  741
#define LC2G2D1N                      742
#define CLC2GLS1_D1T                  743
#define LC2G2D1T                      744
#define CLC2GLS1_D2N                  745
#define LC2G2D2N                      746
#define CLC2GLS1_D2T                  747
#define LC2G2D2T                      748
#define LC2G2D3N                      749
#define CLC2GLS1_D3N                  750
#define LC2G2D3T                      751
#define CLC2GLS1_D3T                  752
#define LC2G2D4N                      753
#define CLC2GLS1_D4N                  754
#define LC2G2D4T                      755
#define CLC2GLS1_D4T                  756
#define CLC2GLS2                      757
#define LC2G3D1N                      758
#define CLC2GLS2_D1N                  759
#define CLC2GLS2_D1T                  760
#define LC2G3D1T                      761
#define CLC2GLS2_D2N                  762
#define LC2G3D2N                      763
#define LC2G3D2T                      764
#define CLC2GLS2_D2T                  765
#define CLC2GLS2_D3N                  766
#define LC2G3D3N                      767
#define CLC2GLS2_D3T                  768
#define LC2G3D3T                      769
#define CLC2GLS2_D4N                  770
#define LC2G3D4N                      771
#define LC2G3D4T                      772
#define CLC2GLS2_D4T                  773
#define CLC2GLS3                      774
#define LC2G4D1N                      775
#define CLC2GLS3_G4D1N                776
#define CLC2GLS3_G4D1T                777
#define LC2G4D1T                      778
#define CLC2GLS3_G4D2N                779
#define LC2G4D2N                      780
#define LC2G4D2T                      781
#define CLC2GLS3_G4D2T                782
#define CLC2GLS3_G4D3N                783
#define LC2G4D3N                      784
#define CLC2GLS3_G4D3T                785
#define LC2G4D3T                      786
#define LC2G4D4N                      787
#define CLC2GLS3_G4D4N                788
#define CLC2GLS3_G4D4T                789
#define LC2G4D4T                      790
#define BSR_ICDSHAD                   791
#define STATUS_SHAD                   792
#define C_SHAD                        793
#define DC_SHAD                       794
#define Z_SHAD                        795
#define WREG_SHAD                     796
#define BSR_SHAD                      797
#define PCLATH_SHAD                   798
#define FSR0L_SHAD                    799
#define FSR0H_SHAD                    800
#define FSR1L_SHAD                    801
#define FSR1H_SHAD                    802
#define STKPTR                        803
#define TOSL                          804
#define TOSH                          805

#endif // _PIC16LF1503_H_
